<template>
  <div>
    <SectionFAQ id="faq" :data="faqData" />
    <SectionChoose :data="choose" />
    <VueVideoPreview ref="videopreview" :data="previewData" />
  </div>
</template>

<script setup lang="ts">
import { ref } from "vue";
import SectionChoose from "~/components/Section/SectionChoose.vue";
import VueVideoPreview from "~/components/Module/VueVideoPreview.vue";

const faqData = ref({
  banner: {
    avatars: [
      {
        img: "/img/avatars/image-3.jpg",
        name: "Люся Сквозных",
      },
      {
        img: "/img/avatars/image-4.jpg",
        name: "Артемка Немой",
      },
    ],
  },
  faqs: [
    {
      title: "Кто делает фундамент под домик?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Возможна ли установка дома зимой?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Что лучше: домик из мини-бруса или модульный дом?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Сколько времени будет изготавливаться дом?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Каким транспортом доставляете дома на участок?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Где проживают рабочие во время монтажа дома?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title:
        "Достаточно ли проектного утепления ограждающих конструкций (пол, стены, кровля) для круглогодичного проживания?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Какие требования по доставке и монтажу на участке?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Каков срок службы дома?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Нужно ли регистрировать дачные домики?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Сколько времени будет изготавливаться дом?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
    {
      title: "Есть ли у вас рассрочка? Можно ли оформить покупку дома в кредит?",
      desc: "Рабочие проживают в арендованном жилье в поселке, где возводится дом, или в ближайшем населенном пункте. Мы не доставляем хозяевам дачи хлопот и неудобств :)",
    },
  ],
});
const previewData = ref({
  videoLink: "https://youtu.be/tAGnKpE4NCI",
  text: "Узнайте о Wood and Life за 3 минуты",
  img: '/img/bathouse-advantages/image-4.jpg'
})

const choose = ref ({
  title: "Выберите, что хотите построить",
  desc: "Ответьте на несколько вопросов, и мы рассчитаем стоимость",
  chooses: [
    {
      img: "/img/choose/1.png",
      title: "Баня бочка",
    },
    {
      img: "/img/choose/2.png",
      title: "А-фрейм",
    },
    {
      img: "/img/choose/3.png",
      title: "Модульный дом",
    },
    {
      img: "/img/choose/4.png",
      title: "Каркасные бани",
    },
    {
      img: "/img/choose/5.png",
      title: "Дачный домик из мини-бруса",
    },
    {
      img: "/img/choose/6.png",
      title: "Дом из двойного бруса",
    },
    {
      img: "/img/choose/7.png",
      title: "Беседка",
    },
    {
      img: "/img/choose/8.png",
      title: "Гриль-домик",
    },
    {
      img: "/img/choose/9.png",
      title: "Дачный комплекс",
    },
    {
      img: "/img/choose/10.png",
      title: "Хозяйственные постройки",
    },
  ]

})
</script>

<style lang="scss">
.faq__wrap {
  padding: 0!important;
}
.faq__content {
  display: flex;
  align-items: flex-start;
  gap: 9rem;
}
.banner-questions {
  display: flex;
  flex-direction: column;
}
</style>