<template>
	<div>
		<HeaderContainer :title="'Выполненные проекты'" :classString="'pt-20 lg:pt-48'" />
		<SectionProduction id="production" :data="productionData" />
		<SectionPortfolio :portfolio="portfolioData" />
		<SectionChoose :data="choose" />
	</div>
</template>

<script setup lang="ts">
import HeaderContainer from "~/components/Ui/HeaderContainer.vue";
import SectionPortfolio from "~/components/Section/SectionPortfolio.vue";
import { ref } from "vue";

const productionData = ref({
	production: {
		// director: "Евгений Киселев",
		// status: "Генеральный директор Wood and Life",
		// title: "Изготавливаем <br>из дерева с 2014 года. Качественно и в срок",
		// productionText: [
		//   "За эти годы мы изучили все особенности и свойства материалов, знаем все нюансы технологии строительства, что позволяет нам без потери качества воплощать любые идеи.",
		//   "<b>Несем ответственность за каждый объект:</b> с момента <br>заключения договора до установки зданий и строений, и в течение всего гарантийного срока.",
		// ],
	},
	team: {

	},
	bath: {
		// title: "Производство",
		// subtitle: "Цифры и факты о нашем производстве",
		facts: [
			{
				icon: "area",
				name: "5 500 м²",
				desc: "Площадь производственных цехов",
			},
			{
				icon: "warehouse",
				name: "3 склада",
				desc: "Большие запасы материалов, соблюдение норм хранения",
			},
			{
				icon: "cpu",
				name: "ЧПУ станки",
				desc: "Изготавливаем с точность до десятых долей миллиметра",
			},
		],
		banner: {
			title: "Лучше один раз увидеть",
			subtitle: "4 минуты видео расскажут <br> все о нашем производстве",
			videoLink: "https://youtu.be/b9McVO9hpUE",
			img: "/img/elements/stove-white.png",
		},
		slides: [
			{
				img: "/img/production/slides/image-1.jpg",
				desc: "Баня мечты",
			},
			{
				img: "/img/production/slides/image-1.jpg",
				desc: "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer quam purus, mollis quis facilisis in, faucibus at elit. Nullam vulputate congue magna in dapibus. Aliquam hendrerit odio est. Vivamus porta, odio eu pulvinar fringilla, dui est ultrices risus, sit amet elementum leo lacus sit amet enim. Aenean dictum, nisi vel consequat imperdiet, lacus ligula tincidunt diam, et molestie neque sem sit amet dolor. Ut nulla velit, mattis quis nisi nec, condimentum tempor mi. Duis feugiat maximus ipsum viverra pharetra.",
			},
			{
				img: "/img/production/slides/image-1.jpg",
				desc: "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer quam purus, mollis quis facilisis in, faucibus at elit.",
			},
		],
	},
});

const choose = ref({
	title: "Выберите, что хотите построить",
	desc: "Ответьте на несколько вопросов, и мы рассчитаем стоимость",
	chooses: [
		{
			img: "/img/choose/1.png",
			title: "Баня бочка",
		},
		{
			img: "/img/choose/2.png",
			title: "А-фрейм",
		},
		{
			img: "/img/choose/3.png",
			title: "Модульный дом",
		},
		{
			img: "/img/choose/4.png",
			title: "Каркасные бани",
		},
		{
			img: "/img/choose/5.png",
			title: "Дачный домик из мини-бруса",
		},
		{
			img: "/img/choose/6.png",
			title: "Дом из двойного бруса",
		},
		{
			img: "/img/choose/7.png",
			title: "Беседка",
		},
		{
			img: "/img/choose/8.png",
			title: "Гриль-домик",
		},
		{
			img: "/img/choose/9.png",
			title: "Дачный комплекс",
		},
		{
			img: "/img/choose/10.png",
			title: "Хозяйственные постройки",
		},
	]

})

const portfolioData = ref({
	items: [
		//"Бани-бочки"
		{
			img: "/img/factory/1.png",
			city: "Нижний новгород",
			wood: "Ель",
			size: "2,1х4 м",
			description: "Баня от Wood and Life просто класс! Отлично держит пар, не требует много дров и прогревается быстро даже в мороз. Уютная и жаркая. Каждый раз, когда хожу в баню с друзьями, наслаждаюсь ароматом кедра.<br><br> Париться одно удовольствие! ",
			section: "Бани-бочки"
		},
		{
			img: "/img/factory/7.png",
			city: "Новочеркаск",
			wood: "Пихта",
			size: "66х99 м",
			description: "Дворец от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Бани-бочки"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Бани-бочки"
		},
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Бани-бочки"
		},
		{
			img: "/img/factory/8.png",
			city: "Ростов-на-дону",
			wood: "Береза",
			size: "12x21 м",
			description: "Квартира от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - надо! ",
			section: "Бани-бочки"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Бани-бочки"
		},
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Бани-бочки"
		},
		{
			img: "/img/factory/7.png",
			city: "Новочеркаск",
			wood: "Пихта",
			size: "66х99 м",
			description: "Дворец от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Бани-бочки"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Бани-бочки"
		},
		//Модульные дома
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Модульные дома"
		},
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Модульные дома"
		},
		{
			img: "/img/factory/7.png",
			city: "Новочеркаск",
			wood: "Пихта",
			size: "66х99 м",
			description: "Дворец от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Модульные дома"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Модульные дома"
		},
		{
			img: "/img/factory/1.png",
			city: "Нижний новгород",
			wood: "Ель",
			size: "2,1х4 м",
			description: "Баня от Wood and Life просто класс! Отлично держит пар, не требует много дров и прогревается быстро даже в мороз. Уютная и жаркая. Каждый раз, когда хожу в баню с друзьями, наслаждаюсь ароматом кедра.<br><br> Париться одно удовольствие! ",
			section: "Модульные дома"
		},
		{
			img: "/img/factory/7.png",
			city: "Новочеркаск",
			wood: "Пихта",
			size: "66х99 м",
			description: "Дворец от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Модульные дома"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Модульные дома"
		},
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Модульные дома"
		},
		{
			img: "/img/factory/8.png",
			city: "Ростов-на-дону",
			wood: "Береза",
			size: "12x21 м",
			description: "Квартира от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - надо! ",
			section: "Модульные дома"
		},
		//Беседки
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Беседки"
		},
		{
			img: "/img/factory/8.png",
			city: "Ростов-на-дону",
			wood: "Береза",
			size: "12x21 м",
			description: "Квартира от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - надо! ",
			section: "Беседки"
		},
		//А-фреймы
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "А-фреймы"
		},
		{
			img: "/img/factory/1.png",
			city: "Нижний новгород",
			wood: "Ель",
			size: "2,1х4 м",
			description: "Баня от Wood and Life просто класс! Отлично держит пар, не требует много дров и прогревается быстро даже в мороз. Уютная и жаркая. Каждый раз, когда хожу в баню с друзьями, наслаждаюсь ароматом кедра.<br><br> Париться одно удовольствие! ",
			section: "А-фреймы"
		},
		{
			img: "/img/factory/7.png",
			city: "Новочеркаск",
			wood: "Пихта",
			size: "66х99 м",
			description: "Дворец от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "А-фреймы"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "А-фреймы"
		},
		//Каркасные бани
		{
			img: "/img/factory/7.png",
			city: "Новочеркаск",
			wood: "Пихта",
			size: "66х99 м",
			description: "Дворец от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Каркасные бани"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Каркасные бани"
		},
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Каркасные бани"
		},
		{
			img: "/img/factory/8.png",
			city: "Ростов-на-дону",
			wood: "Береза",
			size: "12x21 м",
			description: "Квартира от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - надо! ",
			section: "Каркасные бани"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Каркасные бани"
		},
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Каркасные бани"
		},
		{
			img: "/img/factory/7.png",
			city: "Новочеркаск",
			wood: "Пихта",
			size: "66х99 м",
			description: "Дворец от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Каркасные бани"
		},
		//Дачные комплексы
		{
			img: "/img/factory/1.png",
			city: "Нижний новгород",
			wood: "Ель",
			size: "2,1х4 м",
			description: "Баня от Wood and Life просто класс! Отлично держит пар, не требует много дров и прогревается быстро даже в мороз. Уютная и жаркая. Каждый раз, когда хожу в баню с друзьями, наслаждаюсь ароматом кедра.<br><br> Париться одно удовольствие! ",
			section: "Дачные комплексы"
		},
		{
			img: "/img/factory/7.png",
			city: "Новочеркаск",
			wood: "Пихта",
			size: "66х99 м",
			description: "Дворец от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Дачные комплексы"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Дачные комплексы"
		},
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Дачные комплексы"
		},
		{
			img: "/img/factory/8.png",
			city: "Ростов-на-дону",
			wood: "Береза",
			size: "12x21 м",
			description: "Квартира от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - надо! ",
			section: "Дачные комплексы"
		},
		//Гриль-домики
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Гриль-домики"
		},
		{
			img: "/img/factory/8.png",
			city: "Ростов-на-дону",
			wood: "Береза",
			size: "12x21 м",
			description: "Квартира от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - надо! ",
			section: "Гриль-домики"
		},
		//Дома из мини-бруса
		{
			img: "/img/factory/1.png",
			city: "Нижний новгород",
			wood: "Ель",
			size: "2,1х4 м",
			description: "Баня от Wood and Life просто класс! Отлично держит пар, не требует много дров и прогревается быстро даже в мороз. Уютная и жаркая. Каждый раз, когда хожу в баню с друзьями, наслаждаюсь ароматом кедра.<br><br> Париться одно удовольствие! ",
			section: "Дома из мини-бруса"
		},
		{
			img: "/img/factory/7.png",
			city: "Новочеркаск",
			wood: "Пихта",
			size: "66х99 м",
			description: "Дворец от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Дома из мини-бруса"
		},
		{
			img: "/img/factory/5.png",
			city: "Уфа",
			wood: "Дуба-дуб",
			size: "1x1,3 м",
			description: "Дом от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Дома из мини-бруса"
		},
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Дома из мини-бруса"
		},
		{
			img: "/img/factory/8.png",
			city: "Ростов-на-дону",
			wood: "Береза",
			size: "12x21 м",
			description: "Квартира от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - надо! ",
			section: "Дома из мини-бруса"
		},
		//Дома из двойного бруса
		{
			img: "/img/factory/6.png",
			city: "Москва",
			wood: "Баобаб",
			size: "1x1 м",
			description: "Дровеник от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - не надо! ",
			section: "Дома из двойного бруса"
		},
		{
			img: "/img/factory/8.png",
			city: "Ростов-на-дону",
			wood: "Береза",
			size: "12x21 м",
			description: "Квартира от Wood and Life просто класс! Отлично держит бал, не требует много бояр и прогревается быстро даже в революцию. Уютная и жаркая. Каждый раз, когда хожу в бар с друзьями, наслаждаюсь ароматом.<br><br> Париться по пустякам - надо! ",
			section: "Дома из двойного бруса"
		},
	]
})
</script>

<style lang="scss">
.section-name,
.section-prod__flex-block,
.prod-advantages_about-baths,
.prod-bath,
.team-section {
	display: none !important;
}

.section-prod {
	padding-top: 0 !important;
	padding-bottom: 0 !important;
}

.section-prod__advantages-list {
	margin-bottom: 10.4rem;
}

.shadow {
	box-shadow: 0px 24px 48px 0px rgba(145, 158, 171, 0.24), 0px 0px 4px 0px rgba(145, 158, 171, 0.24);
}
</style>